os/control_flow.html
---
layout: page
title: Control_flow
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Kontrollfluss</h2>
<div class="outline-text-2" id="text-1">
<p>
Die Folge von Instruktionen eines Programms bezeichnet man als
<i>Kontrollfluss</i> (engl. <i>control flow</i> oder <i>flow of control</i>). Die
Reihenfolge, in der die Befehle eines Programms ausgeführt werden ist
i.d.R. durch die Reihenfolge der Befehle innerhalb des Programms
vorgegeben. Es gibt aber Möglichkeiten den Kontrollfluss zu Verändern:
</p>

<ul class="org-ul">
<li><i>Kontrollstrukturen</i>: Veränderung des Kontrollfluss als Reaktion auf
eine Veränderung des Programmzustands (z.B. Jump, Call, Return, etc.)
</li>
<li><i><i>Interrupts</i></i>: Veränderung des Kontrollfluss als
Reaktion auf ein Systemereignis (engl. <i>system event</i>)
</li>
</ul>
</div>
</div>
